{"data":{"clients":{"edges":[{"node":{"childImageSharp":{"fluid":{"src":"/portfolio_/static/43d8aced3f9483727f26bb67aa52ab9a/ddb9e/cardiff-driverless.png"}}}},{"node":{"childImageSharp":{"fluid":{"src":"/portfolio_/static/167f865f9030a2d81f4ee36d2136ccb9/ddb9e/logo.png"}}}},{"node":{"childImageSharp":{"fluid":{"src":"/portfolio_/static/7135e2697e567f01a1b18eed63f3215b/ddb9e/cardiff.png"}}}},{"node":{"childImageSharp":{"fluid":{"src":"/portfolio_/static/45a245f9f1e54b7a9b66ee6d8f97d538/ddb9e/TT_logo.png"}}}}]},"testimonials":{"edges":[{"content":{"html":"<p>I had the pleasure of working with Deeon at Tendertec after completing his university degree. I was impressed with his knowledge of Python, Data Structures and Machine Learning. He was open to learning new skills when the project required and has a creative approach to problem solving. He’s always pushing himself to achieve his goals, throughout our time together we frequently discussed projects he was working on that included Web Application Development and using Selenium for web automation, I’ve picked up a couple of tips from these chats. I wish him the best in the future with his career, it would be a honour to work together in the future if the situation arose. </p>","frontmatter":{"id":1,"name":"Richard Davies","profession":"Machine Learning Lead","heading":"Tendertec","image":{"childImageSharp":{"fluid":{"src":"/portfolio_/static/a299aedd24cf52585deb0f58bea21277/c42a3/image.jpg"}}}}}},{"content":{"html":"<p>Deeon is a bright and highly intelligent individual. He enjoys a challenge and is willing to learn new skills to help him in his tasks. He is very knowledgeable of Python, he knows how to use threading and the asyncio library to make sure software is running optimally. His knowledge of artificial intelligence is progressing and he worked closely with the head of machine learning to expand his understanding, particularity on the topic of deep learning. His attitude and work ethic are extremely desirable, his diligence is impressive and he is a pleasure to work with.</p>","frontmatter":{"id":2,"name":"Nabeel Amir","profession":"Fullstack Developer","heading":"Tendertec","image":{"childImageSharp":{"fluid":{"src":"/portfolio_/static/f86f522638910a6a1f313ce602239e84/c42a3/image.jpg"}}}}}}]}}}