{"data":{"items":{"edges":[{"content":{"html":"","frontmatter":{"id":1,"title":"MarketMate","category":"MarketMate","text":"At MarketMate I am the lead Web Developer and work with the full MERN stack. I have worked extensively with Facebook, Linkedin and Twitter APIs in this position, with the majority of the website functionality written by myself. <br/><br/> I am currently leading an entire UI redesign and have familiarised myself with the best practices, executing them in a real world application. During my time at MarketMate I have also been using selenium to test the site and will be updating the current scripts for the redesigned site.<br/><br/> The technoligies used include, but are not limited to:  <br/><br/>\n&middot; lodash  &middot; react-redux  &middot; material-ui  &middot; mongoose  &middot; recharts  &middot;  selenium  &middot;  axios <br/> &middot; react-router  &middot; express &middot; passport &middot; multer &middot; Clickup &middot; Slack","image":{"childImageSharp":{"fluid":{"src":"/portfolio/static/d649ec82e3146f870f24f2a3163f91d8/29d50/image.png"}}}}}},{"content":{"html":"<!-- At Tendertec I had the opportunity to work with various in-house micro-controllers based off the Raspberry Pi and ESP32. Within the first 2 weeks \nI was challenged to redesign the current system to work synchronously to allow for multiple signals to be received and uploaded simulatenously at a high frame rate. I made thorough use of Pythons multiprocessing and threading modules and feel very comfortable with them now. Solutions using asyncio were also explored giving me some background knowledge on the widely used module. <br/> <br/>Although technically not my position, some adjustments occasionally had to be made to micro-controller code, written in C. I still would not say I'm proficient in C, however when a problem arose I was able to use my general programming knowledge to find a solution. -->","frontmatter":{"id":2,"title":"Tendertec","category":"Tendertec","text":"At Tendertec I had the opportunity to work with various in-house micro-controllers based off the Raspberry Pi and ESP32. My first task was redesigning the system to work simultaneously while still receiving data seamlessly, at a high frame rate. I made thorough use of the multiprocessing and threading modules in python and feel confident both working with both micro-controllers and asynchronous programming. This task also entailed heavy use of the sockets module and hand written server/client side code.<br/> <br/> Due to the nature of the work, the resources available once in production were limited. This required close attention to resources being used via both network and hardware. This gave me experience refactoring code to both increase readabilty and use a minimal amount of resources. <br/><br/>  I had the pleasure of being part of the Machine Learning team, working directly with the lead developer on object detection and activity recognition systems. The opportunity to work closely with such an experienced developer has had an invaluable impact on the quality of code I produce now. <br/> <br/>  The technoligies used include, but are not limited to: <br /> <br/ > &middot; cv2 &middot; multiprocessing &middot; threading &middot; asyncio &middot; keras &middot; tensorflow &middot; sockets &middot; TCP/IP &middot; UDP &middot; pathlib &middot; numpy &middot; Jira &middot; Microsoft Teams","image":{"childImageSharp":{"fluid":{"src":"/portfolio/static/8af032fae88e7629b51426d6c79505c9/c384e/image.jpg"}}}}}},{"content":{"html":"","frontmatter":{"id":3,"title":"Deep Learning Guitar Tunings","category":"Deep Learning Guitar Tunings","text":"Deep Learning Guitar Tunings was the task I undertook for my dissertation, it entailed taking using a machine learning model to listen to songs and pick out the tuning that the guitar was in. At the time the task had not been accomplished before, meaning I had to formulate the solution myself - researching deeply into academic papers regarding musical analysis, harmonics, machine learning and signal processing techniques. <br/><br/> \nThe preprocessing consisted of taking a large audio data set and slicing it into uniform sections applying transformations into the frequency domain accordingly. Many parameters were tested to find the optimal solution and required a system to be built that conducted multiple experiments and logged the data effectively.<br/><br/> \nA package compatible with pip was created during development for the all the necessary preprocessing tasks. Intended for use in future development concerning audio analysis.<br/><br/> The problem was solved, proving that semantic data could be extrapolated from audio - even in noisy environments with many different instruments. <br/><br/> \n\nThe technologies used include, but are not limited to: <br/><br/> &middot; librosa &middot; keras &middot; tensorflow &middot; scikit-learn &middot; pandas &middot; os &middot; numpy &middot; scipy &middot; matplotlib &middot; pickle &middot; pip  ","image":{"childImageSharp":{"fluid":{"src":"/portfolio/static/39d8281258c03f8e4ea25bd7eef51649/6a001/image.png"}}}}}},{"content":{"html":"","frontmatter":{"id":4,"title":"Cardiff Racing Driverless","category":"Cardiff Racing Driverless","text":"I was the Team Lead of Cardiff Racing Driverless 2019/20 and member during 2019 summer. Cardiff Racing Driverless was a division of the Cardiff Racing team that would compete in the international IMechE competition, FS-UK. The goal of the competition being to produce the best self driving formula car.<br/><br/> \nAs team lead I had responsibility for growing the team, recruiting new members, liasing with sponsors, attending conferences, giving lectures and holding labs. Within the first month I had grown the number of members from 3 to 15-20 dedicated members with some working on the project on and off. I would also hold weekly lectures to introduce new members to techniques that may not be taught on the curriculum such as machine learning. Working on the project has given me excellent communication skills and stronger project management skills, especially in environments with varying skill levels.<br/><br/>\nAs a member I worked on a reinforcement learning environment that would be used to test the effectiveness of RL in real-time object avoidance. Using a physics based engine - we could simulate wheel turning and some basic LiDAR in the simulation to see if was worth pursuing that path. I also contributed to the cone detection system that would later be used in the final system.\n<br/><br/> \nTechnologies used and researched: <br/><br/> \n&middot; keras &middot; tensorflow &middot; LiDAR &middot; SLAM &middot; Reinforcement Learning &middot; Gaussian Mixture Models &middot; pymunk &middot; pygame &middot; pickle &middot; pandas &middot; Trello &middot; Slack   ","image":{"childImageSharp":{"fluid":{"src":"/portfolio/static/6a48ec2108b5f815aeda0702fde8c780/ea025/image.jpg"}}}}}},{"content":{"html":"","frontmatter":{"id":5,"title":"Unity Game Development","category":"Unity","text":"Having played games my whole life, and now being competent in programming and music production; I have decided to create a 2D game using C# and Unity. <br/><br/> \nI have spent most of my weekends since lockdown writing various scripts to aid game development. As it stands, an A* pathplanning system and weapon pickups/switching have been developed (alongside general movement and shooting mechanics). I have recently begun development on a smart AI system using GOAP(Goal Oriented Action Planning) to give the game some variance and a different feel every time you play. <br/><br/> \nBeing responsible for all parts of the games development has proved an interesting and satisfying exercise. Sound effects and foley in general is something I haven't explored before - and having limited resources at home when it comes to equipment has in fact made it very exciting. Having to find and morph samples, use household objects etc. to turn them into real usable sound effects has turned out to be very fun! <br/><br/>\nI have also decided to start honing my skills in photo editing software to create the sprites and animation. ","image":{"childImageSharp":{"fluid":{"src":"/portfolio/static/81fbf07bce4ca29b5e18e1bb78767fb6/499a7/unity.png"}}}}}},{"content":{"html":"","frontmatter":{"id":6,"title":"Music Experience","category":"Music","text":"Ever since creating a simple DAW as part of an assignment using MATLAB, I have been intrigued by them and sought out to understand and use them effectively. Working with sound and music throughout university in merely a programming context, I was keen to dive deeper into the medium and take up any new project to develop my skills further. <br/><br/>\nI decided to learn the Guitar and have recently picked up a Synthesiser. I am now in a band called Kampango, playing the Guitar and Synth, which regularly play original music in venues around Cardiff. <br/><br/> \nDue to the current situation, studio recordings have been cut short unfortunately. However, the current demos on soundcloud have been produced and edited by myself.<br/><br/>\nTaking on these projects has made me feel confident in my understanding of various synths and has opened up a new area for me to explore.<br/><br/>  ","image":{"childImageSharp":{"fluid":{"src":"/portfolio/static/84818aec0deaa2d433d401a38f324077/a4925/image.jpg"}}}}}}]}}}